#### GetClosestPoint Method

---

|  |
| --- |
| Alignment Class   See Also |

Calculates the point on the alignment's geometry which is closest to the given model point.

**Namespace:**   Autodesk.Revit.DB.Infrastructure
  **Assembly:**   Autodesk.CivilAlignments.DBApplication  (in Autodesk.CivilAlignments.DBApplication.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021.1

# Syntax

| C# |
| --- |
| ``` public XYZ GetClosestPoint( 	XYZ point ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetClosestPoint ( _ 	point As XYZ _ ) As XYZ ``` |

| Visual C++ |
| --- |
| ``` public: XYZ^ GetClosestPoint( 	XYZ^ point ) ``` |

#### Parameters

point
:   Type:  Autodesk.Revit.DB XYZ
     The model point for which to calculate the closest point.

#### Return Value

The alignment point closest to the given model point.

# See Also

Alignment Class

Autodesk.Revit.DB.Infrastructure Namespace